all/.local/bin/guix-root-apply
#!/usr/bin/env bash
# Root Guix apply - channels pull and manifest install (declarative)
# This script uses the synced channels and manifest to pull and apply root’s packages.
# It does not re-benchmark mirrors here, it assumes your bench flow updates channels.scm upstream.


# [[file:../../../root.org::*Root Guix apply - channels pull and manifest install (declarative)][Root Guix apply - channels pull and manifest install (declarative):1]]
set -euo pipefail

ROOT_HOME="$(getent passwd root | cut -d: -f6)"
: "${ROOT_HOME:=/root}"

DEST_CH="$ROOT_HOME/.config/guix/channels.scm"
DEST_MAN="$ROOT_HOME/.config/guix/manifests/root.scm"

if [[ ! -r "$DEST_CH" || ! -r "$DEST_MAN" ]]; then
  echo "Missing root channels or manifest. Run: root-sync" >&2
  exit 1
fi

# Pull with explicit channels
sudo -i env GUIX_LOCPATH="$ROOT_HOME/.guix-profile/lib/locale" guix pull -C "$DEST_CH"

# Apply manifest to root profile
sudo -i env GUIX_LOCPATH="$ROOT_HOME/.guix-profile/lib/locale" guix package -m "$DEST_MAN"

# Make sudo prefer Guix nvim declaratively
TMP="$(mktemp)"
cat > "$TMP" <<'SUDOEOF'
Defaults secure_path="/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/root/.guix-profile/bin:/root/.config/guix/current/bin"
Defaults editor=/root/.guix-profile/bin/nvim, env_editor
SUDOEOF
sudo install -m 0440 "$TMP" /etc/sudoers.d/10-guix-nvim
rm -f "$TMP"

# Optional: sync nvim config again, so plugins or state are aligned if desired
if command -v nvim-sync-root >/dev/null 2>&1; then
  nvim-sync-root || true
fi

echo "Applied root Guix manifest and sudo defaults."
sudo -i nvim --version | sed -n '1,2p' || true
# Root Guix apply - channels pull and manifest install (declarative):1 ends here
